zephyrproject-rtos/hal_microchip/include/dt-bindings/pic32c/pic32cx_sg/pic32cx_sg61/pic32cx1025sg61100-pinctrl.h
/* pc19_gpio */
#define PC19_GPIO MCHP_PINMUX(c, 19, gpio, gpio)

/* pc19a_eic_extint3 */
#define PC19A_EIC_EXTINT3 MCHP_PINMUX(c, 19, a, periph)

/* pc19c_sercom6_pad3 */
#define PC19C_SERCOM6_PAD3 MCHP_PINMUX(c, 19, c, periph)

/* pc19d_sercom0_pad3 */
#define PC19D_SERCOM0_PAD3 MCHP_PINMUX(c, 19, d, periph)

/* pc19f_tcc0_wo3 */
#define PC19F_TCC0_WO3 MCHP_PINMUX(c, 19, f, periph)

/* pc19l_gmac_gtxer */
#define PC19L_GMAC_GTXER MCHP_PINMUX(c, 19, l, periph)

/* pc20_gpio */
#define PC20_GPIO MCHP_PINMUX(c, 20, gpio, gpio)

/* pc20a_eic_extint4 */
#define PC20A_EIC_EXTINT4 MCHP_PINMUX(c, 20, a, periph)

/* pc20f_tcc0_wo4 */
#define PC20F_TCC0_WO4 MCHP_PINMUX(c, 20, f, periph)

/* pc20i_sdhc1_sdcd */
#define PC20I_SDHC1_SDCD MCHP_PINMUX(c, 20, i, periph)

/* pc20l_gmac_grxdv */
#define PC20L_GMAC_GRXDV MCHP_PINMUX(c, 20, l, periph)

/* pc20n_ccl_in9 */
#define PC20N_CCL_IN9 MCHP_PINMUX(c, 20, n, periph)

/* pc21_gpio */
#define PC21_GPIO MCHP_PINMUX(c, 21, gpio, gpio)

/* pc21a_eic_extint5 */
#define PC21A_EIC_EXTINT5 MCHP_PINMUX(c, 21, a, periph)

/* pc21f_tcc0_wo5 */
#define PC21F_TCC0_WO5 MCHP_PINMUX(c, 21, f, periph)

/* pc21i_sdhc1_sdwp */
#define PC21I_SDHC1_SDWP MCHP_PINMUX(c, 21, i, periph)

/* pc21l_gmac_gcol */
#define PC21L_GMAC_GCOL MCHP_PINMUX(c, 21, l, periph)

/* pc21n_ccl_in10 */
#define PC21N_CCL_IN10 MCHP_PINMUX(c, 21, n, periph)

/* pc24_gpio */
#define PC24_GPIO MCHP_PINMUX(c, 24, gpio, gpio)

/* pc24a_eic_extint8 */
#define PC24A_EIC_EXTINT8 MCHP_PINMUX(c, 24, a, periph)

/* pc24c_sercom0_pad2 */
#define PC24C_SERCOM0_PAD2 MCHP_PINMUX(c, 24, c, periph)

/* pc24d_sercom2_pad2 */
#define PC24D_SERCOM2_PAD2 MCHP_PINMUX(c, 24, d, periph)

/* pc24h_tpiu_traced3 */
#define PC24H_TPIU_TRACED3 MCHP_PINMUX(c, 24, h, periph)

/* pc25_gpio */
#define PC25_GPIO MCHP_PINMUX(c, 25, gpio, gpio)

/* pc25a_eic_extint9 */
#define PC25A_EIC_EXTINT9 MCHP_PINMUX(c, 25, a, periph)

/* pc25c_sercom0_pad3 */
#define PC25C_SERCOM0_PAD3 MCHP_PINMUX(c, 25, c, periph)

/* pc25d_sercom2_pad3 */
#define PC25D_SERCOM2_PAD3 MCHP_PINMUX(c, 25, d, periph)

/* pc25h_tpiu_traced2 */
#define PC25H_TPIU_TRACED2 MCHP_PINMUX(c, 25, h, periph)

/* pc26_gpio */
#define PC26_GPIO MCHP_PINMUX(c, 26, gpio, gpio)

/* pc26a_eic_extint10 */
#define PC26A_EIC_EXTINT10 MCHP_PINMUX(c, 26, a, periph)

/* pc26h_tpiu_traced1 */
#define PC26H_TPIU_TRACED1 MCHP_PINMUX(c, 26, h, periph)

/* pc27_gpio */
#define PC27_GPIO MCHP_PINMUX(c, 27, gpio, gpio)

/* pc27a_eic_extint11 */
#define PC27A_EIC_EXTINT11 MCHP_PINMUX(c, 27, a, periph)

/* pc27c_sercom1_pad0 */
#define PC27C_SERCOM1_PAD0 MCHP_PINMUX(c, 27, c, periph)

/* pc27h_tpiu_traceclk */
#define PC27H_TPIU_TRACECLK MCHP_PINMUX(c, 27, h, periph)

/* pc27n_ccl_in4 */
#define PC27N_CCL_IN4 MCHP_PINMUX(c, 27, n, periph)

/* pc28_gpio */
#define PC28_GPIO MCHP_PINMUX(c, 28, gpio, gpio)

/* pc28a_eic_extint12 */
#define PC28A_EIC_EXTINT12 MCHP_PINMUX(c, 28, a, periph)

/* pc28c_sercom1_pad1 */
#define PC28C_SERCOM1_PAD1 MCHP_PINMUX(c, 28, c, periph)

/* pc28h_tpiu_traced0 */
#define PC28H_TPIU_TRACED0 MCHP_PINMUX(c, 28, h, periph)

/* pc28n_ccl_in5 */
#define PC28N_CCL_IN5 MCHP_PINMUX(c, 28, n, periph)

#endif /* MICROCHIP_PIC32CX1025SG61100_PINCTRL_H_ */
